ch93_publications/publications.tex
\begin{change}
The following resources with contributions by the author are publicly available.
Updated information can be found \href{https://orcid.org/0000-0003-3229-0981}{on the author's ``orcid'' profile}.
\subsection{Journal Articles}
\label{sec:org14c08d8}

\begin{itemize}
\item \textbf{Mielke F}, Schunke V, Wölfer J and Nyakatura JA (2018), ``Motion analysis of non-model organisms using a hierarchical model: Influence of setup enclosure dimensions on gait parameters of Swinhoe’s striped squirrels as a test case'', Zoology. Vol. 129, pp. 35-44. \url{https://doi.org/10.1016/j.zool.2018.05.009}

\item \textbf{Mielke F}, Amson E and Nyakatura JA (2018), ``Morpho-Functional Analysis Using Procrustes Superimposition by Static Reference'', Evolutionary Biology., December, 2018. Vol. 45(4), pp. 449-461. \url{https://doi.org/10.1007/s11692-018-9456-9}

\item \textbf{Mielke F}, Van Ginneken C and Aerts P (2019), ``Quantifying intralimb coordination of terrestrial ungulates with Fourier Coefficient Affine Superimposition'', Zoological Journal of the Linnean Society., 11, 2019. Vol. 189(3), pp. 1067-1083. \url{https://doi.org/10.1093/zoolinnean/zlz135}

\item Mielke M, Aerts P, Van Ginneken C, Van Wassenbergh S and \textbf{Mielke F} (2020), ``Progressive tracking: a novel procedure to facilitate manual digitization of videos'', Biology Open., 11, 2020. Vol. 9(11). \url{https://doi.org/10.1242/bio.055962}

\item Nguyen V, Alves Pereira LF, Liang Z, \textbf{Mielke F}, Van Houtte J, Sijbers J and De Beenhouwer J (2022), ``Automatic landmark detection and mapping for 2D/3D registration with BoneNet'', Frontiers in Veterinary Science. 9, 923449. \url{https://doi.org/10.3389/fvets.2022.923449}

\item \textbf{Mielke F}, Van Ginneken C and Aerts P (2023), ``A Workflow for Automatic, High Precision Livestock Diagnostic Screening of Locomotor Kinematics'', Frontiers in Veterinary Science. Vol. 10. \url{https://doi.org/10.3389/fvets.2023.1111140}

\item Aerts P, \textbf{Mielke F}, Vanden Hole C, Van Gorp MJ and Van Ginneken C (2023), ``Early development of locomotion in the term piglet model: does size matter?'', Integrative and Comparative Biology. pp. icad054. \url{https://doi.org/10.1093/icb/icad054}
\end{itemize}
\subsection{Conferences and Public Events}
\label{sec:orge7b2615}
(first author contributions only)

\begin{itemize}
\item Annual Meeting of the \href{https://www.dzg-ev.de/veranstaltungen/jahrestagungen}{German Zoological Society (DZG, 2019)}: ``The Shape of Locomotion: A Method for Large Scale Analyses of Intra-Limb Coordination''. \href{http://mielke-bio.info/falk/posts/05.dzg}{Recording of pre-talk available.}

\item Annual Meeting of the \href{https://sicb.org/meetings/sicb-annual-meeting-2021/}{Society for Integrative and Comparative Biology (SICB, 2021)}: ``Swing it like a piglet!''. \href{http://mielke-bio.info/falk/posts/29.sicb2021}{Recording available}.

\item Annual Meeting of the \href{https://www.sebiology.org/resource/seb-2021-annual-conference.html}{Society of Experimental Biology (SEB, 2021)}: ``CT Density Approximation to Integrate Inverse Dynamics into the XROMM Workflow''. \href{http://mielke-bio.info/falk/posts/26.seb2021}{Recording available}.
\end{itemize}
\subsection{Code Repositories}
\label{sec:org598f2f1}
Here you find the code and code history of recent projects around this thesis.

\begin{itemize}
\item FCAS minimal code in various programming languages. \newline \url{https://git.sr.ht/\~falk/fcas\_code}
\item Free and Open Source XROMM workflow, using blender and avoiding XMALab (for reasons of frustration and ideology).\newline \url{https://git.sr.ht/\~falk/foss\_xromm}
\item Piglet kinematics analysis using FCAS and probabilistic modeling.\newline \url{https://git.sr.ht/\~falk/piglet\_fcas}
\item Application of FCAS to baboon data.\newline \url{https://git.sr.ht/\~falk/papio\_fcas}
\item Code of the ``flying femur'' project.\newline \url{https://git.sr.ht/\~falk/flying\_femur}
\item Automatic video/image segmentation.\newline \url{https://git.sr.ht/\~falk/piglet\_image\_autosegmentation}
\item Thesis defence presentation.\newline \url{https://git.sr.ht/\~falk/defence}
\item PhD thesis wrapping.\newline \url{https://git.sr.ht/\~falk/thesis}
\end{itemize}
\subsection{Blog Posts}
\label{sec:org55b0e74}
All listed posts are self-published and can be found on the website \url{http://mielke-bio.info/falk}.
\subsubsection{Force Plate Calibration}
\label{sec:org1101dcb}
\begin{itemize}
\item equipment considerations\newline \url{http://mielke-bio.info/falk/posts/01.fpequipment}
\item basic calculations\newline \url{http://mielke-bio.info/falk/posts/02.fpcalculations}
\item calibration of force magnitude\newline \url{http://mielke-bio.info/falk/posts/03.fpcalibration1}
\item calibration of contact point\newline \url{http://mielke-bio.info/falk/posts/04.fpcalibration2}
\end{itemize}
\subsubsection{Video Analysis}
\label{sec:orgb1be80c}
\begin{itemize}
\item landmark tracking\newline \url{http://mielke-bio.info/falk/posts/07.tracking}
\item contrast enhancement\newline \url{http://mielke-bio.info/falk/posts/08.image\_contrast}
\item image undistortion\newline \url{http://mielke-bio.info/falk/posts/09.undistortion}
\item stereo camera calibration\newline \url{http://mielke-bio.info/falk/posts/17.camera\_calibration}
\item automatic stride cycle extraction\newline \url{http://mielke-bio.info/falk/posts/27.cycle\_extraction}
\item image segmentation\newline \url{http://mielke-bio.info/falk/posts/30.difflineseg}
\end{itemize}
\subsubsection{Statistics}
\label{sec:orgc0b5489}
\begin{itemize}
\item probabilistic statistical modeling\newline \url{http://mielke-bio.info/falk/posts/06.patella}
\item linear model prediction capability\newline \url{http://mielke-bio.info/falk/posts/33.linearmodels}
\end{itemize}
\subsubsection{Inverse Dynamics}
\label{sec:org99043cc}
\begin{itemize}
\item wrenches\newline \url{http://mielke-bio.info/falk/posts/10.id\_lmx0a\_wrenches}
\item fictitious forces - overview\newline \url{http://mielke-bio.info/falk/posts/11.id\_lmx0b\_fforces}
\item Euler force\newline \url{http://mielke-bio.info/falk/posts/12.id\_lmx1\_stutter}
\item Centrifugal force\newline \url{http://mielke-bio.info/falk/posts/13.id\_lmx2\_vinyl}
\item Coriolis force\newline \url{http://mielke-bio.info/falk/posts/14.id\_lmx3\_slider}
\item D'Alambert force\newline \url{http://mielke-bio.info/falk/posts/15.id\_lmx4\_arm}
\item \textbf{Generalization} - n-link arm\newline \url{http://mielke-bio.info/falk/posts/16.id\_lmx5\_nlink}
\end{itemize}
\subsubsection{CT Analysis}
\label{sec:org7f07fb1}
\begin{itemize}
\item density approximation from CT data\newline \url{http://mielke-bio.info/falk/posts/23.ct\_density}
\end{itemize}
\subsubsection{Miscellaneous}
\label{sec:org0caaa21}
\begin{itemize}
\item Procrustes superimposition\newline \url{http://mielke-bio.info/falk/posts/18.procrustes}
\item quaternions\newline \url{http://mielke-bio.info/falk/posts/21.quaternions}
\item photogrammetry\newline \url{http://mielke-bio.info/falk/posts/22.photogrammetry}
\item custom wildlife cameras\newline \url{http://mielke-bio.info/falk/posts/24.funcameras}
\item academic writing software use\newline \url{http://mielke-bio.info/falk/posts/32.scird2023}
\end{itemize}

\end{change}

